Repository: Osama-matter/Law_Firm
Catalog: Resources/SharedResource.*.resx
Languages: ar

# FirmName
source: Emad Naguib Law Firm
ar: مكتب عماد نجيب للمحاماة

source: Expert Legal Solutions
ar: حلول قانونية متخصصة

source: Welcome to Our Firm
ar: مرحباً بكم في مكتبنا

# AboutFirmDescription
source: Emad Naguib Law Firm is committed to delivering professional and reliable legal services.
ar: مكتب عماد نجيب للمحاماة

# AboutFirmExpertise
source: With extensive experience in civil, commercial, and criminal law, we provide our clients with guidance rooted in integrity, expertise, and effective strategies. Our mission is simple: to protect your rights and achieve successful outcomes in every case.
ar: بفضل خبرتنا الواسعة في القانون المدني والتجاري والجنائي، نقدم لعملائنا إرشادات قائمة على النزاهة والخبرة والاستراتيجيات الفعالة. مهمتنا بسيطة: حماية حقوقك وتحقيق نتائج ناجحة في كل قضية.

source: Learn More
ar: اعرف المزيد

source: Practice Areas
ar: مجالات الممارسة

# PracticeAreasSubtitle
source: We offer expert legal counsel across a wide range of practice areas.
ar: نقدم استشارات قانونية متخصصة في مجموعة واسعة من مجالات الممارسة.

source: Criminal Law
ar: القانون الجنائي

# CriminalLawDesc
source: Our criminal defense attorneys will protect your rights in court.
ar: محامو الدفاع الجنائي لدينا سيحمون حقوقك في المحكمة.

source: Property Law
ar: قانون الملكية

# PropertyLawDesc
source: Expert guidance on real estate transactions and disputes.
ar: إرشادات متخصصة في المعاملات العقارية والنزاعات.

source: Personal Injury
ar: الإصابات الشخصية

# PersonalInjuryDesc
source: Dedicated representation to secure the compensation you deserve.
ar: تمثيل متخصص لتأمين التعويض الذي تستحقه.

source: Commercial Law
ar: القانون التجاري

# CommercialLawDesc
source: Comprehensive legal solutions for your business needs.
ar: حلول قانونية شاملة لاحتياجات عملك.

source: Family Law
ar: قانون الأسرة

# FamilyLawDesc
source: Compassionate handling of sensitive family legal matters.
ar: معالجة رحيمة للمسائل القانونية الأسرية الحساسة.

source: Drug Offence
ar: جرائم المخدرات

# DrugOffenceDesc
source: Strategic defense for drug-related charges and allegations.
ar: دفاع استراتيجي عن التهم والادعاءات المتعلقة بالمخدرات.

source: Contact Us
ar: اتصل بنا

# ContactUsSubtitle
source: Ready to discuss your legal needs? Get in touch with our team today.
ar: هل أنت مستعد لمناقشة احتياجاتك القانونية؟ تواصل مع فريقنا اليوم.

source: Send us a Message
ar: أرسل لنا رسالة

source: Full Name *
ar: الاسم الكامل *

source: Email Address *
ar: البريد الإلكتروني *

source: Subject
ar: الموضوع

source: Message *
ar: الرسالة *

source: Home
ar: الرئيسية

source: Services
ar: خدماتنا

# FooterQuickLinks
source: Quick Links
ar: روابط سريعة

source: Send Message
ar: إرسال الرسالة

# FooterRights
source: All rights reserved.
ar: جميع الحقوق محفوظة.

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Service
ar: شروط الخدمة

source: Disclaimer
ar: إخلاء مسؤولية

# Description
source: Professional legal services in various fields.
ar: الوصف

source: About Us
ar: عنا
